<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">@import url(https://themes.googleusercontent.com/fonts/css?kit=fpjTOVmNbO4Lz34iLyptLUXza5VhXqVC6o75Eld_V98);ol{margin:0;padding:0}table td,table th{padding:0}.c1{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:12pt;font-family:"Times New Roman";font-style:normal}.c0{padding-top:0pt;padding-bottom:8pt;line-height:1.0791666666666666;orphans:2;widows:2;text-align:justify}.c2{background-color:#ffffff;max-width:441.9pt;padding:70.8pt 85pt 70.8pt 85pt}.title{padding-top:24pt;color:#000000;font-weight:700;font-size:36pt;padding-bottom:6pt;font-family:"Calibri";line-height:1.0791666666666666;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:18pt;color:#666666;font-size:24pt;padding-bottom:4pt;font-family:"Georgia";line-height:1.0791666666666666;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Calibri"}p{margin:0;color:#000000;font-size:11pt;font-family:"Calibri"}h1{padding-top:24pt;color:#000000;font-weight:700;font-size:24pt;padding-bottom:6pt;font-family:"Calibri";line-height:1.0791666666666666;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-weight:700;font-size:18pt;padding-bottom:4pt;font-family:"Calibri";line-height:1.0791666666666666;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:14pt;color:#000000;font-weight:700;font-size:14pt;padding-bottom:4pt;font-family:"Calibri";line-height:1.0791666666666666;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:12pt;color:#000000;font-weight:700;font-size:12pt;padding-bottom:2pt;font-family:"Calibri";line-height:1.0791666666666666;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:11pt;color:#000000;font-weight:700;font-size:11pt;padding-bottom:2pt;font-family:"Calibri";line-height:1.0791666666666666;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:10pt;color:#000000;font-weight:700;font-size:10pt;padding-bottom:2pt;font-family:"Calibri";line-height:1.0791666666666666;page-break-after:avoid;orphans:2;widows:2;text-align:left}</style></head><body class="c2 doc-content"><p class="c0"><span class="c1">El proceso de fabricaci&oacute;n de un circuito integrado implica la deposici&oacute;n de capas individuales sobre una l&aacute;mina de silicio. Este proceso es similar al proceso de impresi&oacute;n de im&aacute;genes en color. Se utilizan capas de silicio dopado y otros materiales en lugar de tinta. El proceso de impresi&oacute;n es m&aacute;s simple que el de recubrimiento qu&iacute;mico y plantillas. Para construir un circuito, como un dispositivo transistorizado, este m&eacute;todo combina plantillas secuencialmente. El descubrimiento del circuito integrado, que ha revolucionado la microelectr&oacute;nica y ha permitido la creaci&oacute;n de circuitos electr&oacute;nicos muy complejos en espacios reducidos, fue atribuido a Jack Kilby de Texas Instruments en 1958.</span></p><p class="c0"><span class="c1">Una base de datos es una colecci&oacute;n de datos que est&aacute;n almacenados y accesibles en una computadora. La vida cotidiana contiene bases de datos no mecanizadas, como directorios telef&oacute;nicos. Para ser considerada una base de datos, no es necesario que la informaci&oacute;n est&eacute; clasificada en un orden espec&iacute;fico. Los programas de bases de datos son conjuntos de procedimientos que permiten la selecci&oacute;n de datos, que incluyen sistemas de fichas y lenguajes completos.</span></p><p class="c0"><span class="c1">Una base de datos mecanizada puede contener una gran cantidad de informaci&oacute;n y cualquier computadora puede gestionarla. Sus &uacute;nicas limitaciones son el tama&ntilde;o y la velocidad de la memoria. Se puede crear una lista llamada &quot;gente&quot; que contenga informaci&oacute;n sobre diferentes individuos, y al organizar estos datos en fichas, se obtiene una lista con diferentes categor&iacute;as de informaci&oacute;n, algunas de las cuales son simples palabras y otros n&uacute;meros. Las opciones son limitadas en algunas categor&iacute;as, como el &quot;sexo&quot; (hombre o mujer) y el &quot;estado civil&quot; (soltero, casado, divorciado o viudo).</span></p><p class="c0"><span class="c1">Los m&eacute;dicos se benefician de dispositivos vers&aacute;tiles y econ&oacute;micos, como los computadores, gracias a los avances tecnol&oacute;gicos en la medicina. Los microprocesadores, en particular, han cambiado la forma en que trabaja la medicina, especialmente en unidades de cuidados intensivos, donde se utilizan com&uacute;nmente para monitorear el pulso, la respiraci&oacute;n y la presi&oacute;n sangu&iacute;nea, brindando lecturas instant&aacute;neas de m&uacute;ltiples par&aacute;metros y liberando a las enfermeras de tareas menos importantes.</span></p><p class="c0"><span class="c1">La administraci&oacute;n hospitalaria tambi&eacute;n ha dependido cada vez m&aacute;s de las computadoras para tareas como el registro de pacientes, la programaci&oacute;n de consultas y el control de inventarios de medicamentos.</span></p><p class="c0"><span class="c1">En general, los profesionales m&eacute;dicos obtienen muchos beneficios de los sistemas inform&aacute;ticos en la medicina, incluido un ahorro de tiempo y una mejora en la toma de decisiones m&eacute;dicas.</span></p><p class="c0"><span class="c1">Las t&eacute;cnicas tomogr&aacute;ficas mecanizadas, que utilizan un haz de rayos X delgado en lugar de radiaci&oacute;n generalizada, han mejorado la precisi&oacute;n y la seguridad de los ex&aacute;menes m&eacute;dicos. Adem&aacute;s, los ex&aacute;menes internos se pueden realizar de manera indolora utilizando t&eacute;cnicas como ultrasonidos y resonancia magn&eacute;tica nuclear. La mecanizaci&oacute;n tambi&eacute;n beneficia a los sistemas m&eacute;dicos de urgencia, como el programa de trasplante de &oacute;rganos, que ha mejorado gracias a la ayuda de las bases de datos m&eacute;dicas.</span></p><p class="c0"><span class="c1">George Boole naci&oacute; en Lincoln, Inglaterra, en 1815. A pesar de que falleci&oacute; en 1864, un siglo antes del surgimiento de los microcomputadores, sus ideas sirvieron como base para el desarrollo de los computadores modernos. Boole comenz&oacute; an investigar c&oacute;mo expresar el razonamiento humano en t&eacute;rminos matem&aacute;ticos porque cre&iacute;a que la l&oacute;gica formal era una forma de describir los procesos de razonamiento humano. Su trabajo en l&oacute;gica estableci&oacute; las bases de la computaci&oacute;n contempor&aacute;nea.</span></p><p class="c0"><span class="c1">El Lynx es una computadora desarrollada en Cambridge, Gran Breta&ntilde;a. Es m&aacute;s grande y pesado que el Sinclair Spectrum y el Oric, pero m&aacute;s peque&ntilde;o que los modelos Commodore y Atari de Estados Unidos, aunque a&uacute;n no est&aacute; disponible en el mercado espa&ntilde;ol.</span></p><p class="c0"><span class="c1">La disposici&oacute;n y el tama&ntilde;o del teclado Lynx son similares a los de una m&aacute;quina de escribir, y ofrece un feedback t&aacute;ctil excepcional. Aunque no se muestran en el teclado, puede mostrar hasta ochos colores diferentes en los gr&aacute;ficos almacenados en su memoria. Contiene su propia versi&oacute;n de BASIC, que incluye &oacute;rdenes &uacute;tiles como AUTO para numerar autom&aacute;ticamente las l&iacute;neas del programa. La unidad central de procesamiento del Lynx es el microprocesador Z80, que se encuentra en otros microcomputadores avanzados.</span></p><p class="c0"><span class="c1">El aumento en el uso de computadoras, videos y otros dispositivos con pantallas ha reducido los precios de los monitores. En el pasado, un monitor a color de calidad costaba al menos 150 pesetas, sin embargo, en la actualidad se pueden encontrar a la mitad de ese precio. Los monitores monocrom&aacute;ticos tambi&eacute;n son m&aacute;s baratos.</span></p><p class="c0"><span class="c1">Las se&ntilde;ales de sincronizaci&oacute;n son una para cada l&iacute;nea de la imagen y otra para la imagen en su conjunto. Estas se&ntilde;ales le indican al monitor cu&aacute;ndo debe volver a la pantalla principal. Estas se&ntilde;ales se env&iacute;an a un monitor RGB a trav&eacute;s de cables independientes.</span></p><p class="c0"><span class="c1">En contraste, un monitor compuesto, similar a un televisor, combina todas estas se&ntilde;ales en un solo cable coaxial. Las se&ntilde;ales se separan nuevamente para controlar la imagen una vez que llegan al monitor.</span></p><p class="c0"><span class="c1">John von Neumann, un famoso matem&aacute;tico y cient&iacute;fico austroh&uacute;ngaro, demostr&oacute; un gran talento para las matem&aacute;ticas desde temprana edad y, a los 25 a&ntilde;os, obtuvo dos licenciaturas y un doctorado. Se destac&oacute; en la teor&iacute;a de conjuntos y la teor&iacute;a de juegos, y su prestigio se bas&oacute; en su investigaci&oacute;n sobre la teor&iacute;a de conjuntos, que Bertrand Russell hab&iacute;a desafiado con sus paradojas l&oacute;gicas. Von Neumann se mud&oacute; a los Estados Unidos durante la Segunda Guerra Mundial y all&iacute; comenz&oacute; su carrera acad&eacute;mica y cient&iacute;fica en la Universidad de Princeton.</span></p></body></html>