<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">@import url(https://themes.googleusercontent.com/fonts/css?kit=fpjTOVmNbO4Lz34iLyptLUXza5VhXqVC6o75Eld_V98);ol{margin:0;padding:0}table td,table th{padding:0}.c5{color:#000000;font-weight:700;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Calibri";font-style:normal}.c0{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Times New Roman";font-style:normal}.c2{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Calibri";font-style:normal}.c1{padding-top:0pt;padding-bottom:8pt;line-height:1.0791666666666666;orphans:2;widows:2;text-align:justify}.c3{padding-top:0pt;padding-bottom:8pt;line-height:1.0791666666666666;orphans:2;widows:2;text-align:left}.c6{background-color:#ffffff;max-width:441.9pt;padding:70.8pt 85pt 70.8pt 85pt}.c4{height:11pt}.title{padding-top:24pt;color:#000000;font-weight:700;font-size:36pt;padding-bottom:6pt;font-family:"Calibri";line-height:1.0791666666666666;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:18pt;color:#666666;font-size:24pt;padding-bottom:4pt;font-family:"Georgia";line-height:1.0791666666666666;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Calibri"}p{margin:0;color:#000000;font-size:11pt;font-family:"Calibri"}h1{padding-top:24pt;color:#000000;font-weight:700;font-size:24pt;padding-bottom:6pt;font-family:"Calibri";line-height:1.0791666666666666;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-weight:700;font-size:18pt;padding-bottom:4pt;font-family:"Calibri";line-height:1.0791666666666666;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:14pt;color:#000000;font-weight:700;font-size:14pt;padding-bottom:4pt;font-family:"Calibri";line-height:1.0791666666666666;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:12pt;color:#000000;font-weight:700;font-size:12pt;padding-bottom:2pt;font-family:"Calibri";line-height:1.0791666666666666;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:11pt;color:#000000;font-weight:700;font-size:11pt;padding-bottom:2pt;font-family:"Calibri";line-height:1.0791666666666666;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:10pt;color:#000000;font-weight:700;font-size:10pt;padding-bottom:2pt;font-family:"Calibri";line-height:1.0791666666666666;page-break-after:avoid;orphans:2;widows:2;text-align:left}</style></head><body class="c6 doc-content"><p class="c1"><span class="c0">El aumento en el uso de computadoras en hogares y escuelas est&aacute; impulsando un crecimiento significativo en el n&uacute;mero de personas talentosas en programaci&oacute;n, muchas de las cuales anteriormente no habr&iacute;an considerado una carrera en inform&aacute;tica. Sin embargo, se hace hincapi&eacute; en los riesgos de un aprendizaje superficial, particularmente si se limita al lenguaje BASIC.</span></p><p class="c1"><span class="c0">Se sugiere que las personas que han completado su educaci&oacute;n secundaria y tienen inter&eacute;s en la inform&aacute;tica consideren la posibilidad de cursar estudios universitarios en este campo o en carreras similares. Actualmente, hay muchas universidades que ofrecen programas acad&eacute;micos en inform&aacute;tica, y los graduados con excelentes calificaciones tienen excelentes oportunidades de empleo. Los profesionales como ingenieros, analistas de sistemas y dise&ntilde;adores de software todav&iacute;a tienen una alta demanda.</span></p><p class="c1"><span class="c0">Dado que actualmente hay una escasez de capacitaci&oacute;n en este campo, la ense&ntilde;anza de inform&aacute;tica en las escuelas es otra opci&oacute;n laboral en crecimiento. Se espera que en el futuro, las carreras de educaci&oacute;n inform&aacute;tica tengan un buen salario.</span></p><p class="c1"><span class="c0">Desde el &quot;usuario experimentado&quot; hasta el programador, hay seis niveles principales en la industria de la inform&aacute;tica. Se enfatizan las calificaciones necesarias y el valor de tener la capacidad de pensar l&oacute;gica para convertirse en programador. Adem&aacute;s, se menciona que algunos programadores ingresan sin un t&iacute;tulo formal, lo que atrae tanto a personas con habilidades de programaci&oacute;n como a sus padres.</span></p><p class="c1"><span class="c0">Los analistas de sistemas son muy importantes en la industria y juegan un papel crucial antes de comenzar cualquier proyecto. Su trabajo consiste en entrevistar a los usuarios para comprender sus necesidades, determinar los recursos disponibles y sugerir soluciones. El analista debe ser creativo, tener habilidades de comunicaci&oacute;n s&oacute;lidas y pensar l&oacute;gicamente para tener &eacute;xito en esta funci&oacute;n. Adem&aacute;s, se menciona que son representantes de ventas del departamento de procesamiento de datos con frecuencia.</span></p><p class="c1"><span class="c0">Los programadores se dividen en dos tipos principales: los programadores de aplicaciones, que se enfocan en tareas espec&iacute;ficas y pueden trabajar individualmente o en equipos de proyectos; y los programadores de sistemas, que tambi&eacute;n requieren concentraci&oacute;n y una actitud tranquila para lidiar con el rendimiento general del sistema de procesamiento de datos. La importancia de estas caracter&iacute;sticas para ser programador de sistemas se destaca.</span></p><p class="c1"><span class="c0">Se describe c&oacute;mo se organiza el departamento de inform&aacute;tica en una empresa moderna, con un director de procesamiento de datos liderando y supervisando una variedad de tareas.</span></p><p class="c1"><span class="c0">Los trabajos exigentes que realizan los operadores de grandes computadoras de multiprogramaci&oacute;n requieren habilidades espec&iacute;ficas, como el manejo de hardware, el conocimiento del sistema operativo y las tareas en curso. Los operadores senior tienen la capacidad de tomar decisiones importantes que tienen un impacto en toda la empresa, como permitir o denegar el acceso al sistema de computadora.</span></p><p class="c1"><span class="c0">La innovaci&oacute;n en la industria inform&aacute;tica actual depende de los ingenieros de desarrollo de sistemas. Su trabajo combina elementos cient&iacute;ficos y t&eacute;cnicos para mejorar el rendimiento de componentes de hardware espec&iacute;ficos. Para ingresar en este campo, generalmente se necesitan al menos cinco a&ntilde;os de universidad.</span></p><p class="c1"><span class="c0">Cuando un operador no puede descansar debido an una aver&iacute;a en la computadora, los especialistas t&eacute;cnicos son llamados. A pesar de que el trabajo de los t&eacute;cnicos se ha simplificado gracias a la capacidad de las computadoras modernas para detectar sus propias fallas, todav&iacute;a se necesitan habilidades en electr&oacute;nica digital y mec&aacute;nica. Para ingresar en este campo, generalmente se requiere una cualificaci&oacute;n acad&eacute;mica.</span></p><p class="c1"><span class="c0">Debido a que se considera mal estructurado y puede fomentar malos h&aacute;bitos de programaci&oacute;n, comprender el lenguaje BASIC no es una tarea f&aacute;cil en la industria inform&aacute;tica. Algunos j&oacute;venes pueden ganar dinero escribiendo juegos en BASIC, pero esto no requiere un conocimiento inform&aacute;tico profundo. Se hace referencia a la diferencia entre estos j&oacute;venes y aquellos que pueden escribir en Assembly y tienen un futuro prometedor en la inform&aacute;tica.</span></p><p class="c1"><span class="c0">Los programadores de aplicaciones y sistemas son los dos grupos principales en la industria inform&aacute;tica. Los programadores de aplicaciones trabajan en equipo para desarrollar programas funcionales y se enfocan en programas para tareas espec&iacute;ficas. Los programadores de sistemas, por otro lado, son m&aacute;s especializados, suelen funcionar de forma independiente y se comunican directamente con la m&aacute;quina.</span></p><p class="c1"><span class="c0">A medida que avanzamos en la industria inform&aacute;tica, algunas posiciones solo est&aacute;n disponibles para programadores excepcionalmente talentosos y graduados universitarios excepcionalmente calificados. Los analistas de sistemas y los dise&ntilde;adores son responsables de identificar problemas y determinar c&oacute;mo un sistema inform&aacute;tico puede ayudarlos, como en el caso de una compa&ntilde;&iacute;a petrolera que busca un nuevo yacimiento submarino.</span></p><p class="c1"><span class="c0">A pesar de la alta tasa de desempleo en la industria, se destaca la escasez de personal calificado en inform&aacute;tica. Para abordar esta situaci&oacute;n, se mencionan programas de reciclaje y oportunidades de aprendizaje en todos los niveles de educaci&oacute;n, como el Youth Training Scheme en Gran Breta&ntilde;a, que ofrece capacitaci&oacute;n en microinform&aacute;tica y subvenciona la capacitaci&oacute;n de j&oacute;venes desempleados.</span></p><p class="c1"><span class="c0">Adem&aacute;s, se explica el prop&oacute;sito de los diagramas de flujo en la programaci&oacute;n, que es mostrar de manera clara y sencilla c&oacute;mo fluye la informaci&oacute;n y el control en un programa de computadora. Se hace referencia a los puntos de &quot;condici&oacute;n&quot; y se enfatiza el valor de la representaci&oacute;n gr&aacute;fica para comprender los procesos de programaci&oacute;n.</span></p><p class="c1"><span class="c0">Los diagramas de flujo se utilizan como herramientas visuales para comprender y resolver problemas, con l&iacute;neas y s&iacute;mbolos que representan acciones. Se explica c&oacute;mo se utilizan los &quot;recuadros de decisi&oacute;n&quot; para tomar decisiones sobre el control del programa.</span></p><p class="c1"><span class="c0">Se menciona el funcionamiento de los modems, que convierten las se&ntilde;ales binarias de una computadora en se&ntilde;ales audibles para la transmisi&oacute;n a trav&eacute;s de l&iacute;neas telef&oacute;nicas y luego las convierten de nuevo en se&ntilde;ales binarias en el extremo receptor. Adem&aacute;s, se destaca la posibilidad de que los modems sean costosos debido a la complejidad de transmitir frecuencias cercanas.</span></p><p class="c1"><span class="c0">Se describe brevemente las computadoras port&aacute;tiles Atari, de los modelos 800 y 400, destacando su construcci&oacute;n y capacidades gr&aacute;ficas. Se mencionan requisitos espec&iacute;ficos, como grabadoras especiales para resolver problemas de se&ntilde;ales inarm&oacute;nicas.</span></p><p class="c1"><span class="c0">Se explica el funcionamiento y la estructura de los discos flexibles, que incluyen pistas y sectores. Se explica c&oacute;mo el sistema operativo en disco accede a los sectores utilizando informaci&oacute;n de direcci&oacute;n e identificador para garantizar una lectura precisa.</span></p><p class="c1"><span class="c0">Finalmente, se habla sobre el papel de la tecnolog&iacute;a en las fuerzas armadas y c&oacute;mo los soldados deben estar capacitados para manejar la tecnolog&iacute;a y la lucha convencional. La Guerra de las Malvinas es un ejemplo del poder destructivo de las armas basadas en microchips, como el misil Exocet. Adem&aacute;s, se destaca el uso de computadoras en tanques, como los brit&aacute;nicos Chieftain, para mejorar la velocidad y la precisi&oacute;n en combate.</span></p><p class="c3"><span class="c5">Resumen 2</span></p><p class="c3"><span class="c2">El proceso de fabricaci&oacute;n de un circuito integrado implica la deposici&oacute;n de capas individuales sobre una l&aacute;mina de silicio. Este proceso es similar al proceso de impresi&oacute;n de im&aacute;genes en color. Se utilizan capas de silicio dopado y otros materiales en lugar de tinta. El proceso de impresi&oacute;n es m&aacute;s simple que el de recubrimiento qu&iacute;mico y plantillas. Para construir un circuito, como un dispositivo transistorizado, este m&eacute;todo combina plantillas secuencialmente. El descubrimiento del circuito integrado, que ha revolucionado la microelectr&oacute;nica y ha permitido la creaci&oacute;n de circuitos electr&oacute;nicos muy complejos en espacios reducidos, fue atribuido a Jack Kilby de Texas Instruments en 1958.</span></p><p class="c3"><span class="c2">Una base de datos es una colecci&oacute;n de datos que est&aacute;n almacenados y accesibles en una computadora. La vida cotidiana contiene bases de datos no mecanizadas, como directorios telef&oacute;nicos. Para ser considerada una base de datos, no es necesario que la informaci&oacute;n est&eacute; clasificada en un orden espec&iacute;fico. Los programas de bases de datos son conjuntos de procedimientos que permiten la selecci&oacute;n de datos, que incluyen sistemas de fichas y lenguajes completos.</span></p><p class="c3"><span class="c2">Una base de datos mecanizada puede contener una gran cantidad de informaci&oacute;n y cualquier computadora puede gestionarla. Sus &uacute;nicas limitaciones son el tama&ntilde;o y la velocidad de la memoria. Se puede crear una lista llamada &quot;gente&quot; que contenga informaci&oacute;n sobre diferentes individuos, y al organizar estos datos en fichas, se obtiene una lista con diferentes categor&iacute;as de informaci&oacute;n, algunas de las cuales son simples palabras y otros n&uacute;meros. Las opciones son limitadas en algunas categor&iacute;as, como el &quot;sexo&quot; (hombre o mujer) y el &quot;estado civil&quot; (soltero, casado, divorciado o viudo).</span></p><p class="c3"><span class="c2">Los m&eacute;dicos se benefician de dispositivos vers&aacute;tiles y econ&oacute;micos, como los computadores, gracias a los avances tecnol&oacute;gicos en la medicina. Los microprocesadores, en particular, han cambiado la forma en que trabaja la medicina, especialmente en unidades de cuidados intensivos, donde se utilizan com&uacute;nmente para monitorear el pulso, la respiraci&oacute;n y la presi&oacute;n sangu&iacute;nea, brindando lecturas instant&aacute;neas de m&uacute;ltiples par&aacute;metros y liberando a las enfermeras de tareas menos importantes.</span></p><p class="c3"><span class="c2">La administraci&oacute;n hospitalaria tambi&eacute;n ha dependido cada vez m&aacute;s de las computadoras para tareas como el registro de pacientes, la programaci&oacute;n de consultas y el control de inventarios de medicamentos.</span></p><p class="c3"><span class="c2">En general, los profesionales m&eacute;dicos obtienen muchos beneficios de los sistemas inform&aacute;ticos en la medicina, incluido un ahorro de tiempo y una mejora en la toma de decisiones m&eacute;dicas.</span></p><p class="c3"><span class="c2">Las t&eacute;cnicas tomogr&aacute;ficas mecanizadas, que utilizan un haz de rayos X delgado en lugar de radiaci&oacute;n generalizada, han mejorado la precisi&oacute;n y la seguridad de los ex&aacute;menes m&eacute;dicos. Adem&aacute;s, los ex&aacute;menes internos se pueden realizar de manera indolora utilizando t&eacute;cnicas como ultrasonidos y resonancia magn&eacute;tica nuclear. La mecanizaci&oacute;n tambi&eacute;n beneficia a los sistemas m&eacute;dicos de urgencia, como el programa de trasplante de &oacute;rganos, que ha mejorado gracias a la ayuda de las bases de datos m&eacute;dicas.</span></p><p class="c3"><span class="c2">George Boole naci&oacute; en Lincoln, Inglaterra, en 1815. A pesar de que falleci&oacute; en 1864, un siglo antes del surgimiento de los microcomputadores, sus ideas sirvieron como base para el desarrollo de los computadores modernos. Boole comenz&oacute; an investigar c&oacute;mo expresar el razonamiento humano en t&eacute;rminos matem&aacute;ticos porque cre&iacute;a que la l&oacute;gica formal era una forma de describir los procesos de razonamiento humano. Su trabajo en l&oacute;gica estableci&oacute; las bases de la computaci&oacute;n contempor&aacute;nea.</span></p><p class="c3"><span class="c2">El Lynx es una computadora desarrollada en Cambridge, Gran Breta&ntilde;a. Es m&aacute;s grande y pesado que el Sinclair Spectrum y el Oric, pero m&aacute;s peque&ntilde;o que los modelos Commodore y Atari de Estados Unidos, aunque a&uacute;n no est&aacute; disponible en el mercado espa&ntilde;ol.</span></p><p class="c3"><span class="c2">La disposici&oacute;n y el tama&ntilde;o del teclado Lynx son similares a los de una m&aacute;quina de escribir, y ofrece un feedback t&aacute;ctil excepcional. Aunque no se muestran en el teclado, puede mostrar hasta ochos colores diferentes en los gr&aacute;ficos almacenados en su memoria. Contiene su propia versi&oacute;n de BASIC, que incluye &oacute;rdenes &uacute;tiles como AUTO para numerar autom&aacute;ticamente las l&iacute;neas del programa. La unidad central de procesamiento del Lynx es el microprocesador Z80, que se encuentra en otros microcomputadores avanzados.</span></p><p class="c3"><span class="c2">El aumento en el uso de computadoras, videos y otros dispositivos con pantallas ha reducido los precios de los monitores. En el pasado, un monitor a color de calidad costaba al menos 150 pesetas, sin embargo, en la actualidad se pueden encontrar a la mitad de ese precio. Los monitores monocrom&aacute;ticos tambi&eacute;n son m&aacute;s baratos.</span></p><p class="c3"><span class="c2">Las se&ntilde;ales de sincronizaci&oacute;n son una para cada l&iacute;nea de la imagen y otra para la imagen en su conjunto. Estas se&ntilde;ales le indican al monitor cu&aacute;ndo debe volver a la pantalla principal. Estas se&ntilde;ales se env&iacute;an a un monitor RGB a trav&eacute;s de cables independientes.</span></p><p class="c3"><span class="c2">En contraste, un monitor compuesto, similar a un televisor, combina todas estas se&ntilde;ales en un solo cable coaxial. Las se&ntilde;ales se separan nuevamente para controlar la imagen una vez que llegan al monitor.</span></p><p class="c3"><span class="c2">John von Neumann, un famoso matem&aacute;tico y cient&iacute;fico austroh&uacute;ngaro, demostr&oacute; un gran talento para las matem&aacute;ticas desde temprana edad y, a los 25 a&ntilde;os, obtuvo dos licenciaturas y un doctorado. Se destac&oacute; en la teor&iacute;a de conjuntos y la teor&iacute;a de juegos, y su prestigio se bas&oacute; en su investigaci&oacute;n sobre la teor&iacute;a de conjuntos, que Bertrand Russell hab&iacute;a desafiado con sus paradojas l&oacute;gicas. Von Neumann se mud&oacute; a los Estados Unidos durante la Segunda Guerra Mundial y all&iacute; comenz&oacute; su carrera acad&eacute;mica y cient&iacute;fica en la Universidad de Princeton.</span></p><p class="c3 c4"><span class="c2"></span></p><p class="c3 c4"><span class="c2"></span></p></body></html>